Extensions/src/Documents/ИзменениеПараметровВА/ИзменениеПараметровВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ИзменениеПараметровВА</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>AzRyВидОперации_Deprecated</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="326543f3-c936-4d45-a8ed-fb350df4ecae">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизацииДоИзменения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СчетПереоценкиРегл</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетПереоценки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>4</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПрименитьВТекущемМесяце</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>AzRyСпособАмортизации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Enums/СпособыНачисленияАмортизацииВнеоборотныхАктивов/СпособыНачисленияАмортизацииВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыНачисленияАмортизацииВнеоборотныхАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>УменьшенногоОстатка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПропорциональноОбъемуПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Линейный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/ИзменениеПараметровВА/ObjectModule.bsl
&Вместо("ОбработкаПроведения")
Процедура РасшAzRy_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ИзменениеПараметровВА.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВнеоборотныеАктивы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков ---
	
	// +++ { AzRy - [12.10.2021] - Jira:ERPM-863 - Developer: George Mamulashvili
	УправлениеНебольшойФирмойСервер.ОтразитьСостоянияВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	// +++ } AzRy - [12.10.2021] - Jira:ERPM-863 - Developer: George Mamulashvili	
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура РасшAzRy_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаВнеоборотныхАктивов Из ВнеоборотныеАктивы Цикл
		
		// +++ { AzRy - [20.02.2018] - Jira:ERPM-631 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
		Если AzRyВидОперации = Перечисления.AzRyВидыОперацийИзменениеПараметровВА.ИзменениеСпособаАмортизации Тогда
			М = Новый Массив;
			М.Добавить("ВнеоборотныеАктивы.СтоимостьДляВычисленияАмортизации");
			М.Добавить("ВнеоборотныеАктивы.СчетЗатрат");
			Для каждого ТекСтрока Из М Цикл
				Индекс = ПроверяемыеРеквизиты.Найти(ТекСтрока);
				Если Не Индекс = Неопределено Тогда
					ПроверяемыеРеквизиты.Удалить(Индекс);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		
		Если СтрокаВнеоборотныхАктивов.AzRyСпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка
			И СтрокаВнеоборотныхАктивов.ПроцентАмортизации = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Поле Процент амортизации должен быть заполнен.'; ka = 'ამორტიზაციის პროცენტის ველი არაა შევსებული'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			"ВнеоборотныеАктивы",
			СтрокаВнеоборотныхАктивов.НомерСтроки,
			"ПроцентАмортизации",
			Отказ
			);			
		КонецЕсли;
		// +++ } AzRy - [20.02.2018] - Jira:ERPM-631 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	
	КонецЦикла;
	
КонецПроцедуры
